package com.mayisports.qca.bean;

import java.util.List;

/**
 * Created by Zpj on 2017/12/12.
 */

public class SelectResultBean {

    /**
     * status : {"login":0}
     * data : {"leagueCompFilter":[["414","俄青联",1,0,0,"2","0"],["242","伊朗超",1,0,0,"1","0"],["268","南非超",1,0,0,"3","0"],["105","罗甲",1,0,0,"2","0"],["111","土甲",1,0,0,"2","0"],["112","保超",1,0,0,"2","0"],["137","塞浦甲",1,0,0,"2","0"],["22","俄超",1,0,0,"2","0"],["37","土超",1,0,0,"2","0"],["138","以甲",1,0,0,"2","0"],["39","希腊超",1,0,0,"2","0"],["19","丹麦超",1,0,0,"2","0"],["29","荷乙",1,0,0,"2","0"],["32","葡超",1,0,0,"2","0"],["102","瑞士甲",1,0,0,"2","0"],["99","以超",1,0,0,"2","0"],["21","德乙",1,0,0,"7","0"],["24","法乙",1,0,0,"7","0"],["44","英冠",1,0,0,"7","0"],["38","西甲",1,0,0,"7","1"],["41","意甲",1,0,0,"7","1"],["364","阿乙",1,0,0,"4","0"],["14","阿甲",1,0,0,"4","0"],["489","东亚女足",1,0,0,"1",null]]}
     */

    public StatusBean status;
    public DataBean data;

    public static class StatusBean {
        /**
         * login : 0
         */

        public int login;
    }

    public static class DataBean {
        public List<List<String>> leagueCompFilter;
    }
}
