package com.mayisports.qca.bean;

import java.util.List;

/**
 * 球队榜 球员榜
 * Created by zhangpengju on 2018/5/3.
 */

public class TeamRankListBean {


    /**
     * data : {"team":[{"title":"点球","list":[[8,"巴伦西亚"],[7,"皇家马德里"],[6,"毕尔巴鄂竞技"],[6,"赫罗纳"],[5,"莱万特"],[4,"拉斯帕尔马斯"],[4,"赫塔菲"],[4,"马德里竞技"],[3,"拉科鲁尼亚"],[3,"塞维利亚"],[3,"马拉加"],[3,"比利亚雷亚尔"],[2,"埃瓦尔"],[2,"巴塞罗那"],[2,"塞尔塔"],[2,"雷加利斯"],[2,"皇家贝蒂斯"],[1,"西班牙人"],[1,"皇家社会"],[1,"阿拉维斯"]]},{"title":"进球","list":[[637,"皇家马德里"],[518,"巴塞罗那"],[450,"塞维利亚"],[439,"巴伦西亚"],[426,"拉科鲁尼亚"],[422,"埃瓦尔"],[398,"比利亚雷亚尔"],[395,"塞尔塔"],[392,"毕尔巴鄂竞技"],[385,"皇家社会"],[384,"赫罗纳"],[374,"皇家贝蒂斯"],[364,"雷加利斯"],[359,"莱万特"],[359,"西班牙人"],[357,"阿拉维斯"],[356,"赫塔菲"],[347,"马德里竞技"],[331,"马拉加"],[257,"拉斯帕尔马斯"]]}],"player":[{"title":"首发","list":[["36","A.科雷亚","马德里竞技"],["35","奎利亚尔","雷加利斯"],["35","I.威廉士","毕尔巴鄂竞技"],["35","洛博特卡","塞尔塔"],["35","克里斯蒂安.波尔图","赫罗纳"],["35","巴拉古尔诺","西班牙人"],["35","帕切科","阿拉维斯"],["34","迪希奧","赫塔菲"],["34","罗伯托","马拉加"],["34","D.莫雷诺","西班牙人"]]},{"title":"替补","list":[["19","托雷斯","马德里竞技"],["18","弗恩特","西班牙人"],["17","E.莫尔","塞尔塔"],["15","艾文奴保定","莱万特"],["15","莫拉","赫塔菲"],["15","卡纳莱斯","皇家社会"],["14","加梅罗","马德里竞技"],["14","路易斯","赫罗纳"],["14","特略","皇家贝蒂斯"],["14","切里舍夫","比利亚雷亚尔"]]},{"title":"上场时间","list":[["3150","巴拉古尔诺","西班牙人"],["3150","奎利亚尔","雷加利斯"],["3087","帕切科","阿拉维斯"],["3060","D.莫雷诺","西班牙人"],["3060","特尔施特根","巴塞罗那"],["3060","罗伯托","马拉加"],["3060","奥布拉克","马德里竞技"],["3060","迪米杜域","埃瓦尔"],["2970","达格马","赫塔菲"],["2970","L.靴南迪斯","马拉加"]]},{"title":"点球","list":[["6","巴利祖","巴伦西亚"],["5","史杜安尼","赫罗纳"],["4","J.卡莱里","拉斯帕尔马斯"],["3","C.罗纳尔多","皇家马德里"],["3","摩拉里斯","莱万特"],["3","莫利纳","赫塔菲"],["3","R.加西亚","毕尔巴鄂竞技"],["3","佩雷斯","拉科鲁尼亚"],["3","阿杜里茨","毕尔巴鄂竞技"],["2","梅西","巴塞罗那"]]},{"title":"射门","list":[["186","梅西","巴塞罗那"],["165","C.罗纳尔多","皇家马德里"],["111","L.苏亚雷斯","巴塞罗那"],["95","巴拉古尔诺","西班牙人"],["88","阿斯帕斯","塞尔塔"],["86","J.卡莱里","拉斯帕尔马斯"],["82","罗德里戈","巴伦西亚"],["80","R.加西亚","毕尔巴鄂竞技"],["75","M.高美斯","塞尔塔"],["71","格列兹曼","马德里竞技"]]},{"title":"射正","list":[["91","梅西","巴塞罗那"],["72","C.罗纳尔多","皇家马德里"],["53","L.苏亚雷斯","巴塞罗那"],["44","巴拉古尔诺","西班牙人"],["41","阿斯帕斯","塞尔塔"],["39","格列兹曼","马德里竞技"],["36","罗德里戈","巴伦西亚"],["34","R.加西亚","毕尔巴鄂竞技"],["33","M.高美斯","塞尔塔"],["32","卡洛斯.巴卡","比利亚雷亚尔"]]},{"title":"被侵犯","list":[["107","哈达迪","阿拉维斯"],["104","加西亚","赫罗纳"],["86","M.高美斯","塞尔塔"],["74","梅西","巴塞罗那"],["73","R.加西亚","毕尔巴鄂竞技"],["73","席思图","塞尔塔"],["69","奎克","埃瓦尔"],["67","卡塞米罗","皇家马德里"],["67","巴拉古尔诺","西班牙人"],["66","M.加西亚","阿拉维斯"]]},{"title":"最佳","list":[["21","梅西","巴塞罗那"],["10","阿斯帕斯","塞尔塔"],["7","格列兹曼","马德里竞技"],["7","C.罗纳尔多","皇家马德里"],["6","A.可莱纳","赫罗纳"],["6","巴利祖","巴伦西亚"],["6","巴拉古尔诺","西班牙人"],["5","伊利亚拉门迪","皇家社会"],["5","贝尔","皇家马德里"],["4","皮里斯","雷加利斯"]]},{"title":"传球","list":[["2305","伊利亚拉门迪","皇家社会"],["2289","拉基蒂奇","巴塞罗那"],["2229","巴利祖","巴伦西亚"],["2163","罗德里戈·埃尔南德斯","比利亚雷亚尔"],["2010","巴内加","塞维利亚"],["1970","布茨克斯","巴塞罗那"],["1913","A.曼迪","皇家贝蒂斯"],["1902","洛博特卡","塞尔塔"],["1900","阿尔巴","巴塞罗那"],["1883","菲比安","皇家贝蒂斯"]]},{"title":"关键传球","list":[["82","梅西","巴塞罗那"],["73","佩雷斯","拉科鲁尼亚"],["65","巴利祖","巴伦西亚"],["64","A.可莱纳","赫罗纳"],["64","阿斯帕斯","塞尔塔"],["62","巴内加","塞维利亚"],["56","克罗斯","皇家马德里"],["54","苏塞塔","毕尔巴鄂竞技"],["50","马塞洛","皇家马德里"],["50","科克","马德里竞技"]]},{"title":"助攻","list":[["12","梅西","巴塞罗那"],["9","席思图","塞尔塔"],["9","贡萨洛.盖德斯","巴伦西亚"],["9","弗纳尔斯","比利亚雷亚尔"],["9","L.苏亚雷斯","巴塞罗那"],["8","本泽马","皇家马德里"],["8","格列兹曼","马德里竞技"],["8","阿尔巴","巴塞罗那"],["7","A.可莱纳","赫罗纳"],["7","卢卡斯","皇家马德里"]]},{"title":"长传","list":[["940","奎利亚尔","雷加利斯"],["875","迪米杜域","埃瓦尔"],["762","瓜伊塔","赫塔菲"],["758","罗伯托","马拉加"],["745","帕切科","阿拉维斯"],["648","阿里扎巴拉加","毕尔巴鄂竞技"],["609","波诺","赫罗纳"],["556","奥布拉克","马德里竞技"],["549","阿丹","皇家贝蒂斯"],["518","保罗·洛佩斯","西班牙人"]]},{"title":"黄牌","list":[["343","迪米杜域","埃瓦尔"],["332","阿里扎巴拉加","毕尔巴鄂竞技"],["330","奎利亚尔","雷加利斯"],["317","帕切科","阿拉维斯"],["285","罗伯托","马拉加"],["251","阿尔比拉","埃瓦尔"],["236","瓜伊塔","赫塔菲"],["216","特尔施特根","巴塞罗那"],["215","阿丹","皇家贝蒂斯"],["212","波诺","赫罗纳"]]},{"title":"直塞","list":[["23","梅西","巴塞罗那"],["14","科克","马德里竞技"],["12","伊涅斯塔","巴塞罗那"],["12","弗纳尔斯","比利亚雷亚尔"],["10","波尔蒂略","赫塔菲"],["10","伊斯科","皇家马德里"],["9","瓜尔达多","皇家贝蒂斯"],["9","阿森西奥","皇家马德里"],["8","L.苏亚雷斯","巴塞罗那"],["8","R.加西亚","毕尔巴鄂竞技"]]},{"title":"带球摆脱","list":[["214","安赫尔","埃瓦尔"],["159","巴利祖","巴伦西亚"],["158","A.可莱纳","赫罗纳"],["156","苏塞塔","毕尔巴鄂竞技"],["155","罗萨莱斯","马拉加"],["151","佩雷斯","拉科鲁尼亚"],["147","阿尔瓦罗·奥德里奥佐拉","皇家社会"],["145","胡安弗兰","拉科鲁尼亚"],["143","马塞洛","皇家马德里"],["142","摩拉里斯","莱万特"]]},{"title":"过人","list":[["164","梅西","巴塞罗那"],["83","摩拉里斯","莱万特"],["76","贡萨洛.盖德斯","巴伦西亚"],["74","巴内加","塞维利亚"],["74","席思图","塞尔塔"],["64","A.科雷亚","马德里竞技"],["61","贾努扎伊","皇家社会"],["60","菲比安","皇家贝蒂斯"],["56","阿斯帕斯","塞尔塔"],["56","华金","皇家贝蒂斯"]]},{"title":"越位","list":[["53","L.苏亚雷斯","巴塞罗那"],["43","哈达迪","阿拉维斯"],["40","C.罗纳尔多","皇家马德里"],["39","莫利纳","赫塔菲"],["36","佩雷斯","拉科鲁尼亚"],["35","J.卡莱里","拉斯帕尔马斯"],["35","卡洛斯.巴卡","比利亚雷亚尔"],["33","阿杜里茨","毕尔巴鄂竞技"],["29","L.穆里尔","塞维利亚"],["29","巴拉古尔诺","西班牙人"]]},{"title":"拦截","list":[["121","萨乌尔","马德里竞技"],["103","罗萨莱斯","马拉加"],["101","路易辛霍","拉科鲁尼亚"],["98","罗德里戈·埃尔南德斯","比利亚雷亚尔"],["98","桑切斯","西班牙人"],["93","奥托","塞尔塔"],["91","M.加西亚","阿拉维斯"],["90","卡塞米罗","皇家马德里"],["87","马里奥","比利亚雷亚尔"],["87","卢卡斯.埃尔南德斯","马德里竞技"]]},{"title":"犯规","list":[["81","R.加西亚","毕尔巴鄂竞技"],["70","罗德里戈·埃尔南德斯","比利亚雷亚尔"],["69","皮纳","阿拉维斯"],["68","桑切斯","西班牙人"],["67","迪希奧","赫塔菲"],["65","萨乌尔","马德里竞技"],["65","J.卡莱里","拉斯帕尔马斯"],["65","史杜安尼","赫罗纳"],["60","A.可莱纳","赫罗纳"],["58","M.加西亚","阿拉维斯"]]},{"title":"红牌","list":[["1","A.干沙里斯","马拉加"],["1","皮里斯","雷加利斯"],["1","米克尔","马拉加"],["1","马塞洛","皇家马德里"],["1","S.桑切斯","马拉加"],["1","加维斯","拉斯帕尔马斯"],["1","达米安","赫塔菲"],["1","卡瓦哈尔","皇家马德里"],["1","阿马特","皇家贝蒂斯"],["1","A.曼迪","皇家贝蒂斯"]]},{"title":"乌龙","list":[["2","赫莫索","西班牙人"],["2","圣何塞","毕尔巴鄂竞技"],["1","塞尔吉","埃瓦尔"],["1","阿尔比拉","埃瓦尔"],["1","Z.费迪拿","皇家贝蒂斯"],["1","阿马特","皇家贝蒂斯"],["1","博维达","拉科鲁尼亚"],["1","古希美","拉科鲁尼亚"],["1","阿拉纳","塞维利亚"],["1","S.雷东多","莱万特"]]},{"title":"进球","list":[["32","梅西","巴塞罗那"],["24","C.罗纳尔多","皇家马德里"],["22","L.苏亚雷斯","巴塞罗那"],["20","阿斯帕斯","塞尔塔"],["19","格列兹曼","马德里竞技"],["19","史杜安尼","赫罗纳"],["16","罗德里戈","巴伦西亚"],["15","巴拉古尔诺","西班牙人"],["15","卡洛斯.巴卡","比利亚雷亚尔"],["14","M.高美斯","塞尔塔"]]},{"title":"传球成功率","list":[["100","佛浪","皇家贝蒂斯"],["100","赫克托·埃尔南德斯","阿拉维斯"],["100","阿里曼尼","赫罗纳"],["100","乔.坎普尔","皇家贝蒂斯"],["100","A.鲁伊巴尔","皇家贝蒂斯"],["100","A.墨雅","马德里竞技"],["94","科瓦西奇","皇家马德里"],["93.8","塞巴洛斯","皇家马德里"],["93.7","马科斯略伦特","皇家马德里"],["93.2","马克.罗","西班牙人"]]},{"title":"进球率","list":[["100","M.奥利维拉","赫塔菲"],["50","Z.费迪拿","皇家贝蒂斯"],["40","鲁伊斯","比利亚雷亚尔"],["40","拉瓜迪亚","阿拉维斯"],["33.3","弗兰西斯","皇家贝蒂斯"],["33.3","哈基姆","皇家马德里"],["33.3","N.维达尔","巴伦西亚"],["33.3","纳乔","皇家马德里"],["31.1","史杜安尼","赫罗纳"],["30.4","桑纳比亚","皇家贝蒂斯"]]}]}
     */

    public DataBean data;

    public static class DataBean {
        public List<PlayerBean> team;
        public List<PlayerBean> player;

        public static class TeamBean {
            /**
             * title : 点球
             * list : [[8,"巴伦西亚"],[7,"皇家马德里"],[6,"毕尔巴鄂竞技"],[6,"赫罗纳"],[5,"莱万特"],[4,"拉斯帕尔马斯"],[4,"赫塔菲"],[4,"马德里竞技"],[3,"拉科鲁尼亚"],[3,"塞维利亚"],[3,"马拉加"],[3,"比利亚雷亚尔"],[2,"埃瓦尔"],[2,"巴塞罗那"],[2,"塞尔塔"],[2,"雷加利斯"],[2,"皇家贝蒂斯"],[1,"西班牙人"],[1,"皇家社会"],[1,"阿拉维斯"]]
             */

            public String title;
            public List<List<String>> list;
        }

        public static class PlayerBean {
            /**
             * title : 首发
             * list : [["36","A.科雷亚","马德里竞技"],["35","奎利亚尔","雷加利斯"],["35","I.威廉士","毕尔巴鄂竞技"],["35","洛博特卡","塞尔塔"],["35","克里斯蒂安.波尔图","赫罗纳"],["35","巴拉古尔诺","西班牙人"],["35","帕切科","阿拉维斯"],["34","迪希奧","赫塔菲"],["34","罗伯托","马拉加"],["34","D.莫雷诺","西班牙人"]]
             */

            public String title;
            public List<List<String>> list;
        }
    }
}
